Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>EnumRef.ВидыУслугПриИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтвета</name>
    <type>
      <types>EnumRef.ФорматОтветаНаЗапросИОН</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставленияСправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйПараметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматЗапроса</name>
    <type>
      <types>EnumRef.ФорматыДокументооборотаСФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНалогов</name>
    <type>
      <types>EnumRef.КоличествоНалоговДляСверкиИОН</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапрашиваемыеНалоги</name>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Налог</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыУслугПриИОН/ВидыУслугПриИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУслугПриИОН</name>
  <enumValues>
    <name>ПредставлениеАктовСверкиРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеПеречняБухгалтерскойИНалоговойОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеСправкиОСостоянииРасчетовСБюджетом</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеСправкиОбИсполненииОбязанностейПоУплате</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ФорматОтветаНаЗапросИОН/ФорматОтветаНаЗапросИОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматОтветаНаЗапросИОН</name>
  <enumValues>
    <name>TXT</name>
  </enumValues>
  <enumValues>
    <name>PDF</name>
  </enumValues>
  <enumValues>
    <name>RTF</name>
  </enumValues>
  <enumValues>
    <name>XML</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>УдалитьXLS</name>
  </enumValues>
  <enumValues>
    <name>XLS</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыТранспортныхСообщений/ТипыТранспортныхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТранспортныхСообщений</name>
  <enumValues>
    <name>ПервичноеСообщениеСодержащееОтчетность</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПрочее</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПервичноеСообщениеСодержащееОтчетностьПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеПолученияОтчетностиПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПротоколПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПротоколКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУведомлениеОбОшибкеПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПисьмоВходящееПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПисьмоВходящееКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПисьмоИсходящееПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПисьмоИсходящееКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДекларацияНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеПодтверждениеНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРезультатПриемаНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатОбработкиДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРезультатОбработкиНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУведомлениеОбОшибкеФНС</name>
  </enumValues>
  <enumValues>
    <name>УдалитьФорма2НДФЛНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОбращениеНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПисьмоНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРассылкаНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеПисьмоНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРассылкаНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатОбработкиЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗаявлениеНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатОбработкиЗаявлениеРФНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРезультатОбработкиРФНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСообщениеОбОтзывеЗаявлениеРФНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОбОтзывеЗаявлениеРФНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатОбработкиЗаявлениеТСНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРезультатОбработкиТСНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПодтверждениеЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДокументНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеДокументНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатПриемаДокументНП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеРезультатПриемаНО</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКритическаяОшибка</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОтправкиОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанноеПодтверждениеОтправкиОтчетности</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияОПриемеФайлаОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПротоколВходногоКонтроляОтчетности</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанныйПротоколВходногоКонтроляОтчетности</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточненииНБО</name>
  </enumValues>
  <enumValues>
    <name>Протокол2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НеформализованныйДокументНО</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеНаНеформализованныйДокументНО</name>
  </enumValues>
  <enumValues>
    <name>НеформализованныйДокументНалогоплательщика</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОтправкиНеформализованногоДокументаНалогоплательщика</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанноеПодтверждениеОтправкиНеформализованногоДокументаНалогоплательщика</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеДоставкиНеформализованногоДокументаНалогоплательщика</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИОН</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОтправкиЗапросаИОН</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанноеПодтверждениеОтправкиЗапросаИОН</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияОПриемеЗапросаИОН</name>
  </enumValues>
  <enumValues>
    <name>ПротоколВходногоКонтроляЗапросаИОН</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанныйПротоколВходногоКонтроляЗапросаИОН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросИОН</name>
  </enumValues>
  <enumValues>
    <name>ПереподписанныйОтветНаЗапросИОН</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСообщениеСодержащееОтчетностьПФР</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПолученияОтчетностиПФР</name>
  </enumValues>
  <enumValues>
    <name>ПротоколПФР</name>
  </enumValues>
  <enumValues>
    <name>ПротоколКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОшибкеПФР</name>
  </enumValues>
  <enumValues>
    <name>ПисьмоВходящееПФР</name>
  </enumValues>
  <enumValues>
    <name>ПисьмоВходящееКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>ПисьмоИсходящееПФР</name>
  </enumValues>
  <enumValues>
    <name>ПисьмоИсходящееКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияНП</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПодтверждениеНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРезультатПриемаНП</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиДекларацияНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРезультатОбработкиНП</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОшибкеФНС</name>
  </enumValues>
  <enumValues>
    <name>Форма2НДФЛНП</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаФорма2НДФЛНО</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОбращениеНО</name>
  </enumValues>
  <enumValues>
    <name>ПисьмоНО</name>
  </enumValues>
  <enumValues>
    <name>РассылкаНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПисьмоНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРассылкаНП</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНП</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиЗапросНО</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиЗаявлениеРФНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРезультатОбработкиРФНП</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОбОтзывеЗаявлениеРФНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОбОтзывеЗаявлениеРФНП</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиЗаявлениеТСНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРезультатОбработкиТСНП</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеЗаявлениеНО</name>
  </enumValues>
  <enumValues>
    <name>ДокументНО</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеДокументНП</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаДокументНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеРезультатПриемаНО</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСообщениеСодержащееОтчетностьФСГС</name>
    <comment>Отчет</comment>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеДатыОтправкиФСГС</name>
    <comment>Подтверждение</comment>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПодтверждениеДатыОтправкиФСГС</name>
    <comment>ПодтверждениеКвитанция</comment>
  </enumValues>
  <enumValues>
    <name>ПереподписанноеПодтверждениеОтправкиОтчетностиФСГС</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолученииОтчетностиФСГС</name>
    <comment>ОтчетИзвещение</comment>
  </enumValues>
  <enumValues>
    <name>ПротоколВходногоКонтроляОтчетностиФСГС</name>
    <comment>Протокол</comment>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПротоколВходногоКонтроляОтчетностиФСГС</name>
    <comment>ПротоколИзвещение</comment>
  </enumValues>
  <enumValues>
    <name>ПисьмоВходящееФСГС</name>
    <comment>Письмо</comment>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПисьмоВходящееФСГС</name>
    <comment>Извещение</comment>
  </enumValues>
  <enumValues>
    <name>ПисьмоИсходящееФСГС</name>
    <comment>Письмо</comment>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПисьмоИсходящееФСГС</name>
    <comment>Извещение</comment>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОшибкеФСГС</name>
  </enumValues>
  <enumValues>
    <name>РассылкаФСГС</name>
  </enumValues>
  <enumValues>
    <name>ПредставлениеНП</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеПредставлениеНО</name>
  </enumValues>
  <enumValues>
    <name>РезультатПриемаПредставлениеНО</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПредставлениеНО</name>
  </enumValues>
  <enumValues>
    <name>ПервичноеСообщениеСодержащееЗапросПФР</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеПолученияЗапросаПФР</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПФР</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросКвитанцияПФР</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаВыпискуЕРГЮЛ_ЕГРИП</name>
  </enumValues>
  <enumValues>
    <name>УдалитьРезультатОбработкиЗапросаНаВыпискуЕРГЮЛ_ЕГРИП</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаВыпискуЕРГЮЛ_ЕГРИП</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиЗапросаНаВыпискуЕРГЮЛ_ЕГРИП</name>
  </enumValues>
  <enumValues>
    <name>РезультатОбработкиЗаявлениеНО</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ЗапросНаИнформационноеОбслуживаниеНалогоплательщика/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Печатная форма запросов на сверку с ФНС.
//
Функция ПечатнаяФорма(Сверка) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	// получаем бланк отчета из макета
	Бланк = Документы.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.ПолучитьМакет("Сверка");
	
	ПараметрыЗапроса = ПараметрыЗапроса(Сверка);
	
	ЗаполнитьВерхнююЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса);
	ЗаполнитьТабличнуюЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса);
	ЗаполнитьНижнююЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса);
	
	ТабДокумент.МасштабПечати = 100;
	Возврат ТабДокумент;
	
КонецФункции

Функция НаименованиеКБК(ЗначениеКБК) Экспорт
	
	Если СтрДлина(СокрЛП(ЗначениеКБК)) = 20 Тогда
		ТаблицаКБК 		= ПолучитьТаблицуКБК();
		НайденнаяСтрока = ТаблицаКБК.Найти(ЗначениеКБК, "КБК");
		Если НайденнаяСтрока <> Неопределено Тогда
			Возврат НайденнаяСтрока.Наименование;
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуКБК() Экспорт
	
	МакетКБК = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО().ПолучитьМакет("КБК");
	
	КБК = Новый ТаблицаЗначений;
	КБК.Колонки.Добавить("КБК", 		 Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(20)));
	КБК.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(500)));
	КБК.Колонки.Добавить("Налог", 		 Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	КБК.Колонки.Добавить("Папка", 		 Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100)));
	
	КБК.Колонки.Добавить("ДоступноДляОрганизаций", 		Новый ОписаниеТипов("Булево"));
	КБК.Колонки.Добавить("ДоступноДляИПБезСотрудников", Новый ОписаниеТипов("Булево"));
	КБК.Колонки.Добавить("ДоступноДляИПССотрудниками", 	Новый ОписаниеТипов("Булево"));
	
	КБК.Колонки.Добавить("ОСНО", 	Новый ОписаниеТипов("Булево"));
	КБК.Колонки.Добавить("УСН", 	Новый ОписаниеТипов("Булево"));
	КБК.Колонки.Добавить("ЕНВД", 	Новый ОписаниеТипов("Булево"));
	КБК.Колонки.Добавить("ПСН", 	Новый ОписаниеТипов("Булево"));
	
	Для Инд = 2 По МакетКБК.ВысотаТаблицы Цикл
		
		НовСтр = КБК.Добавить();
		
		Для каждого Колонка Из КБК.Колонки Цикл
			Индекс = КБК.Колонки.Индекс(Колонка) + 1;
			НовСтр[Колонка.Имя] = СокрЛП(МакетКБК.Область(Инд, Индекс, Инд, Индекс).Текст);
		КонецЦикла; 
		
	КонецЦикла;
	
	КБК.Индексы.Добавить("КБК");
	
	Возврат КБК;
	
КонецФункции

Функция ОбработатьСтрокуПоискаКБК(СтрокаПоиска) Экспорт
	
	// Если больше 26 символов, скорее всего это не Код БК, а текст -
	// см. шаблон отформатированного КБК: 182 1 01 01011 01 1000 110
	Если СтрДлина(СокрЛП(СтрокаПоиска)) > 26 Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;
	
	// Попробуем получить Код БК
	СтрокаПоискаБезПробелов = СтрЗаменить(СтрокаПоиска, " ", "");
	
	// В Коде БК должны быть только цифры
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоискаБезПробелов) Тогда
		Возврат СтрокаПоиска;
	КонецЕсли;

	Возврат СтрокаПоискаБезПробелов;
	
КонецФункции

Функция ТаблицаКБКСФильтрамиПоСвойствамОрганизации(Организация = Неопределено, ТаблицаКБК = Неопределено, ДатаНа = Неопределено) Экспорт
	
	Если ТаблицаКБК = Неопределено Тогда
		ТаблицаКБК = ПолучитьТаблицуКБК();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ТаблицаКБК;
	КонецЕсли;
	
	Отбор = Новый Структура();
	
	// Признаки ООО/ИП с сотрудниками/ИП без сотрудников являются взаимоисключающими, поэтому
	// на них можно накладывать набор одновременно.
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	Если ЭтоЮрЛицо Тогда
		Отбор.Вставить("ДоступноДляОрганизаций", Истина);
	Иначе
		ИПИспользуетТрудНаемныхРаботников = РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(Организация);
		Если ИПИспользуетТрудНаемныхРаботников Тогда
			Отбор.Вставить("ДоступноДляИПССотрудниками", Истина);
		Иначе
			Отбор.Вставить("ДоступноДляИПБезСотрудников", Истина);
		КонецЕсли;
	КонецЕсли;
	
	СистемыНалогообложения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		Организация,
		ДатаНа,
		"СистемыНалогообложения,").СистемыНалогообложения;
	
	Если ЗначениеЗаполнено(СистемыНалогообложения) Тогда
		ТаблицаКБК = ТаблицаКБК.Скопировать(Отбор);
		ТаблицаКБК.Колонки.Добавить("ПоддерживаетсяДляДаннойОрганизации");
		
		// Признаки систем налогообложения являются взаимодополняемыми, так как у одной организации
		// может быть различное сочетание этих признаков.
		СистемыНалогообложения = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СистемыНалогообложения, ",", Истина, Истина);
		Для каждого СтрокаТаблицыКБК Из ТаблицаКБК Цикл
			Для каждого СистемаНалогообложения Из СистемыНалогообложения Цикл
				Если СтрокаТаблицыКБК[СистемаНалогообложения] = Истина Тогда
					СтрокаТаблицыКБК["ПоддерживаетсяДляДаннойОрганизации"]  = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Отбор = Новый Структура();
		Отбор.Вставить("ПоддерживаетсяДляДаннойОрганизации", Истина);
		ТаблицаКБК = ТаблицаКБК.Скопировать(Отбор);
		ТаблицаКБК.Колонки.Удалить("ПоддерживаетсяДляДаннойОрганизации");
		
	Иначе
		// Отбор только по виду организации без учета системы налогообложения.
		ТаблицаКБК = ТаблицаКБК.Скопировать(Отбор);
	КонецЕсли;
	
	Возврат ТаблицаКБК;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатнаяФормаСверки


#Область ВерхняяЧасть

Процедура ЗаполнитьВерхнююЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса)

	ВерхняяЧастьБланка = Бланк.ПолучитьОбласть("ВерхняяЧасть");
	
	ЗаполнитьКодИФНС(Сверка, Бланк, ВерхняяЧастьБланка);
	ЗаполнитьНаименование(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьИННЦеликомИПосимвольно(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьИндекс(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьАдрес(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьКПП(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьКодИФНСОтвета(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьКодЗапроса(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьФорматОтвета(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьГод(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьПериод(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса);
	
	ТабДокумент.Вывести(ВерхняяЧастьБланка);

КонецПроцедуры

Процедура ЗаполнитьКодИФНС(Сверка, Бланк, ВерхняяЧастьБланка)
	
	// Если организация состоит на учете в двух и более ИФНС и нужна справка о расчетах со всеми ИФНС, 
	// то в сверке в строке "Код ИФНС" указывается значение "0000", КПП не указывается.
	
	// Получаем данные.
	Если НЕ ЗначениеЗаполнено(Сверка.Получатель) Тогда
		КодИФНСПолучателя = "0000";
	Иначе
		КодИФНСПолучателя = СокрЛП(Сверка.Получатель.Код);
	КонецЕсли;
	
	// Выводим в макет.
	ВывестиПосимвольно(ВерхняяЧастьБланка, КодИФНСПолучателя, "ИФНС", 4);
	
КонецПроцедуры

Процедура ЗаполнитьНаименование(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	Наименование = "";
	
	Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
		Наименование = СокрЛП(ПараметрыЗапроса.НаимЮЛПол);
	Иначе
		Наименование =
			СокрЛП(ПараметрыЗапроса.ИПФамилия) + " " + 
			СокрЛП(ПараметрыЗапроса.ИПИмя) + " " +
			СокрЛП(ПараметрыЗапроса.ИПОтчество);
	КонецЕсли;

	// Выводим в макет.
	ВерхняяЧастьБланка.Параметры["Наименование"] = Наименование;
	
КонецПроцедуры

Процедура ЗаполнитьИННЦеликомИПосимвольно(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	ИНН = "";
	
	Если ПараметрыЗапроса.ПрПодп = 1 Тогда // отправитель - налогоплательщик
		Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
			ИНН = СокрЛП(ПараметрыЗапроса.ИННЮЛ);
		Иначе
			ИНН = СокрЛП(ПараметрыЗапроса.ИННФЛ);
		КонецЕсли;
	Иначе
		СвДоверенность = ПараметрыЗапроса.Доверенность;
		СвПредст = СвДоверенность.СвУпПред.СвПред;
		Если СвПредст.Свойство("СвОрг") Тогда // представитель - ЮЛ
			ИНН = СокрЛП(СвПредст.СвОрг.ИННЮЛ);
		Иначе
			Если СвПредст.СведФизЛ.ЯвляетсяСотрудникомОрганизации Тогда
				Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
					ИНН = СокрЛП(ПараметрыЗапроса.ИННЮЛ);
				Иначе
					ИНН = СокрЛП(ПараметрыЗапроса.ИННФЛ);
				КонецЕсли;
			Иначе	
				ИНН = СокрЛП(СвПредст.СведФизЛ.ИННФЛ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Выводим в макет.
	ВерхняяЧастьБланка.Параметры["ИНН"] = ИНН;
	ВывестиПосимвольно(ВерхняяЧастьБланка, ИНН, "ИНН", 12);
	
КонецПроцедуры

Процедура ЗаполнитьИндекс(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	Индекс = "";
	Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
		АдрНП = РегламентированнаяОтчетностьКлиентСервер.РазложитьАдрес(ПараметрыЗапроса.АдрЮр);
	Иначе
		АдрНП = РегламентированнаяОтчетностьКлиентСервер.РазложитьАдрес(ПараметрыЗапроса.АдрМЖ);
	КонецЕсли;
	Индекс = АдрНП.Индекс;
	
	// Выводим в макет.
	ВывестиПосимвольно(ВерхняяЧастьБланка, Индекс, "Индекс", 6);
	
КонецПроцедуры

Процедура ЗаполнитьАдрес(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	Адрес = "";
	
	Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
		Адрес = ПараметрыЗапроса.АдрЮр;
	Иначе
		Адрес = ПараметрыЗапроса.АдрМЖ;
	КонецЕсли;
	Адрес = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых(Адрес, Истина);
	
	// Выводим в макет.
	ВерхняяЧастьБланка.Параметры["Адрес"] = Адрес;
	
КонецПроцедуры

Процедура ЗаполнитьКПП(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	КПП = "";
	
	Если ПараметрыЗапроса.ПрПодп = 1 Тогда // отправитель - налогоплательщик
		Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
			КПП = СокрЛП(ПараметрыЗапроса.КППЮЛ);
		КонецЕсли;
	Иначе
		СвДоверенность = ПараметрыЗапроса.Доверенность;
		СвПредст = СвДоверенность.СвУпПред.СвПред;
		Если СвПредст.Свойство("СвОрг") Тогда // представитель - ЮЛ
			КПП = СокрЛП(СвПредст.СвОрг.КПП);
		Иначе
			Если СвПредст.СведФизЛ.ЯвляетсяСотрудникомОрганизации Тогда
				Если НЕ ПараметрыЗапроса.ЭтоПБОЮЛ Тогда
					КПП = СокрЛП(ПараметрыЗапроса.КППЮЛ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Выводим в макет.
	ВывестиПосимвольно(ВерхняяЧастьБланка, КПП, "КПП", 9, "");
	
КонецПроцедуры

Процедура ЗаполнитьКодИФНСОтвета(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	ИНФСОтвета = "";
	
	Если НЕ ЗначениеЗаполнено(Сверка.Получатель) Тогда
		ИНФСОтвета = СокрЛП(РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Сверка.Организация, , "КодНО").КодНО);
	Иначе
		ИНФСОтвета = СокрЛП(Сверка.Получатель.Код);
	КонецЕсли;
	
	// Выводим в макет.
	ВывестиПосимвольно(ВерхняяЧастьБланка, ИНФСОтвета, "ИНФСОтвета", 4);
	
КонецПроцедуры

Процедура ЗаполнитьКодЗапроса(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	СоответствиеВидаУслугиКоду = Новый Соответствие;
	СоответствиеВидаУслугиКоду.Вставить(Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОСостоянииРасчетовСБюджетом, "1");
	СоответствиеВидаУслугиКоду.Вставить(Перечисления.ВидыУслугПриИОН.ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом, "2");
	СоответствиеВидаУслугиКоду.Вставить(Перечисления.ВидыУслугПриИОН.ПредставлениеПеречняБухгалтерскойИНалоговойОтчетности, "3");
	СоответствиеВидаУслугиКоду.Вставить(Перечисления.ВидыУслугПриИОН.ПредставлениеАктовСверкиРасчетов, "4");
	СоответствиеВидаУслугиКоду.Вставить(Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОбИсполненииОбязанностейПоУплате, "5");

	КодЗапроса = СоответствиеВидаУслугиКоду[Сверка.ВидУслуги];
	
	// Выводим в макет.
	ВерхняяЧастьБланка.Параметры["КодЗапроса"] = КодЗапроса;
	
КонецПроцедуры

Процедура ЗаполнитьФорматОтвета(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	СоответствиеФорматовОтветовИдентификатору = Новый Соответствие;
	СоответствиеФорматовОтветовИдентификатору.Вставить(Перечисления.ФорматОтветаНаЗапросИОН.RTF, "1");
	СоответствиеФорматовОтветовИдентификатору.Вставить(Перечисления.ФорматОтветаНаЗапросИОН.XML, "2");
	СоответствиеФорматовОтветовИдентификатору.Вставить(Перечисления.ФорматОтветаНаЗапросИОН.XLS, "3");
	СоответствиеФорматовОтветовИдентификатору.Вставить(Перечисления.ФорматОтветаНаЗапросИОН.PDF, "4");

	ФорматОтвета = СоответствиеФорматовОтветовИдентификатору[Сверка.ФорматОтвета];
	
	// Выводим в макет.
	ВерхняяЧастьБланка.Параметры["ФорматОтвета"] = ФорматОтвета;
	
КонецПроцедуры

Процедура ЗаполнитьГод(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	// Получаем данные.
	Год = "";
	Если Сверка.ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеВыпискиОперацийИзКарточкиРасчетыСБюджетом Тогда
		Год = Формат(Сверка.ДатаОкончанияПериода, "ДФ=yyyy");
	КонецЕсли;

	// Выводим в макет.
	ВывестиПосимвольно(ВерхняяЧастьБланка, Год, "Год", 4, "");
	
КонецПроцедуры

Процедура ЗаполнитьПериод(Сверка, Бланк, ВерхняяЧастьБланка, ПараметрыЗапроса)
	
	ВерхняяЧастьБланка.Параметры["Период2"] = НСтр("ka='c <__.__.____> по <__.__.____>';ru='c <__.__.____> по <__.__.____>';en='c <__.__.____> on <__.__.____>'");
	ВерхняяЧастьБланка.Параметры["Период3"] = НСтр("ka='на <__.__.____>';ru='на <__.__.____>';en='on <__.__.____>'");
	ВерхняяЧастьБланка.Параметры["Период4"] = НСтр("ka='год <__.__.__.__> на <__.__.____>';ru='год <__.__.__.__> на <__.__.____>';en='year <__.__.__.__> to <__.__.____>'");

	Если Сверка.ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеПеречняБухгалтерскойИНалоговойОтчетности Тогда
		
		ДатаНач = Формат(Сверка.ДатаНачалаПериода, "ДФ=dd.MM.yyyy");
		ДатаКон = Формат(Сверка.ДатаОкончанияПериода, "ДФ=dd.MM.yyyy");
		Период2 = НСтр("ka='c <%1> по <%2>';ru='c <%1> по <%2>';en='c <% 1> to <2%>'");
		
		Период2 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Период2,
			ДатаНач,
			ДатаКон);
		
		ВерхняяЧастьБланка.Параметры["Период2"] = Период2;

	ИначеЕсли Сверка.ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОСостоянииРасчетовСБюджетом
		ИЛИ Сверка.ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеСправкиОбИсполненииОбязанностейПоУплате Тогда
		
		НаДату  = Формат(Сверка.ДатаОкончанияПериода, "ДФ=dd.MM.yyyy");
		Период3 = НСтр("ka='на <%1>';ru='на <%1>';en='on <% 1>'");
		
		Период3 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Период3,
			НаДату);
		
		ВерхняяЧастьБланка.Параметры["Период3"] = Период3;
		
	ИначеЕсли Сверка.ВидУслуги = Перечисления.ВидыУслугПриИОН.ПредставлениеАктовСверкиРасчетов Тогда
		
		Год 	= Формат(Сверка.ДатаОкончанияПериода, "ДФ=yyyy");
		НаДату 	= Формат(Сверка.ДатаОкончанияПериода, "ДФ=dd.MM.yyyy");
		Период4 = НСтр("ka='год <%1> на <%2>';ru='год <%1> на <%2>';en='year <% 1> to <2%>'");
		
		Период4 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			Период4,
			Год,
			НаДату);
		
		ВерхняяЧастьБланка.Параметры["Период4"] = Период4;

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область Таблица

Процедура ЗаполнитьТабличнуюЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса)

	СтрокаТабличнойЧастиБланка = Бланк.ПолучитьОбласть("Таблица");
	
	Для каждого Налог Из Сверка.ЗапрашиваемыеНалоги Цикл
		
		СтрокаТабличнойЧастиБланка.Параметры["КБК"] 				= Налог.КБК;
		СтрокаТабличнойЧастиБланка.Параметры["ОКАТОИлиОКТМО"] 		= Налог.ОКАТО;
		СтрокаТабличнойЧастиБланка.Параметры["НаименованиеНалога"] 	= НаименованиеКБК(Налог.КБК);
		
		ТабДокумент.Вывести(СтрокаТабличнойЧастиБланка);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область НижняяЧасть

Процедура ЗаполнитьНижнююЧастьСверки(Сверка, ТабДокумент, Бланк, ПараметрыЗапроса)

	НижняяЧастьБланка = Бланк.ПолучитьОбласть("НижняяЧасть");
	
	ЗаполнитьПризнакУполномоченногоПредставителя(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьПодписанта(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса);
	ЗаполнитьДатуСверки(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса);
	
	ТабДокумент.Вывести(НижняяЧастьБланка);

КонецПроцедуры

Процедура ЗаполнитьПризнакУполномоченногоПредставителя(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса)

	НижняяЧастьБланка.Параметры["ПризнакУполномоченногоПредставителя"] = ПараметрыЗапроса.ПрПодп;

КонецПроцедуры

Процедура ЗаполнитьПодписанта(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса)

	Если ПараметрыЗапроса.ПрПодп = 1 Тогда
		
		ФИОПодписанта = РегламентированнаяОтчетность.РазложитьФИО(ПараметрыЗапроса.ФИОРук);
		
		ФИО = Новый Структура();
		ФИО.Вставить("Фамилия", 	СокрЛП(ФИОПодписанта.Фамилия));
		ФИО.Вставить("Имя", 		СокрЛП(ФИОПодписанта.Имя));
		ФИО.Вставить("Отчество", 	СокрЛП(ФИОПодписанта.Отчество));
	
	Иначе
		
		ФИОПодписанта = ПараметрыЗапроса.Доверенность.СвУпПред.СвПред.СведФизЛ.ФИО;
		
		ФИО = Новый Структура();
		ФИО.Вставить("Фамилия", 	СокрЛП(ФИОПодписанта.Фамилия));
		ФИО.Вставить("Имя", 		СокрЛП(ФИОПодписанта.Имя));
		ФИО.Вставить("Отчество", 	СокрЛП(ФИОПодписанта.Отчество));
		
	КонецЕсли;
			
	Подписант = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);
	
	НижняяЧастьБланка.Параметры["ФИО"] = Подписант;

КонецПроцедуры

Процедура ЗаполнитьДатуСверки(Сверка, Бланк, НижняяЧастьБланка, ПараметрыЗапроса)

	УстановитьПривилегированныйРежим(Истина);
	
	ЦиклОбмена = ДокументооборотСКОВызовСервера.ПолучитьПоследнийЦиклОбмена(Сверка);
	
	КонтекстЭДОСервер 	= ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	СообщенияЦикла		= КонтекстЭДОСервер.ПолучитьСообщенияЦиклаОбмена(ЦиклОбмена);
	СтрЗапросыНП 		= СообщенияЦикла.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыТранспортныхСообщений.ЗапросНП));
	
	Если СтрЗапросыНП.Количество() = 0 Тогда
		НижняяЧастьБланка.Параметры["ДатаСверки"] = Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
	Иначе
		НижняяЧастьБланка.Параметры["ДатаСверки"] = Формат(СтрЗапросыНП[0].ДатаТранспорта, "ДЛФ=DD");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыПечатнойФормы

Функция ПараметрыЗапроса(Сверка)

	УстановитьПривилегированныйРежим(Истина);
	
	КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДОСервер.СформироватьПараметрыЗапроса(Сверка);

КонецФункции

Процедура ВывестиПосимвольно(
		ТабличныйДокумент, 
		Значение, 
		ПрефиксИмениПараметра, 
		КоличествоКлеток, 
		СимволНаполнения = "-")
	
	ДлинаЗначения = СтрДлина(Значение);
	Для НомерСимвола = 0 По КоличествоКлеток - 1 Цикл
		
		ИмяПраметра = ПрефиксИмениПараметра + Строка(НомерСимвола + 1);
		
		Если НомерСимвола > ДлинаЗначения - 1 Тогда
			ЗначениеПараметра = СимволНаполнения;
		Иначе
			ЗначениеПараметра = Сред(Значение, НомерСимвола + 1, 1);
		КонецЕсли;
		
		ТабличныйДокумент.Параметры[ИмяПраметра] = ЗначениеПараметра;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Документ", "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
